<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom"><title>street.yoga - Fitness</title><link href="http://127.0.0.1:8000/" rel="alternate"></link><link href="http://127.0.0.1:8000/feeds/fitness.atom.xml" rel="self"></link><id>http://127.0.0.1:8000/</id><updated>2020-10-02T00:00:00+02:00</updated><subtitle>Yoga &amp; Machines</subtitle><entry><title>Physical Health For Fitness</title><link href="http://127.0.0.1:8000/Please%20do%20exercise.html" rel="alternate"></link><published>2020-10-02T00:00:00+02:00</published><updated>2020-10-02T00:00:00+02:00</updated><author><name>streetyogi</name></author><id>tag:127.0.0.1,2020-10-02:/Please do exercise.html</id><summary type="html">&lt;p&gt;Traning has to become second nature, a habbit&lt;/p&gt;</summary><content type="html">&lt;div class="gist"&gt;
    &lt;script src='https://gist.github.com/037f9a271324524e775e.js?file=Physical_Health_For_Fitness.md'&gt;&lt;/script&gt;
    &lt;noscript&gt;
        &lt;pre&gt;&lt;code&gt;- [x] Self-esteem  
  I have been tested, I have passed through many tests  
  It is a gift from God that you have my attention, my life  

- [x] Strength, Endurance  
  I have passed several physical endurance tests, my fitness is of the top 1% in the world  
  You will know my physical characteristics in a second  
  I am one of the few people who can do yoga, high-level body weight  

- [x] Exercise videos in different languages  
  Video lessons and exercises to learn from the best  
  Videos about exercise  

- [x] How it started  
  I was inspired to make an exercise program for people of all ages and levels   
  My wife and I are very active and love to travel  
  Since I was introduced to yoga, I started looking for alternatives for our health  
  I started making a list of my favorite yoga poses. The list got longer and longer  

- [x] Long, progressive training sessions  
  Videos to enable self-reliant exercising for long term success  

- [x] My primary goal is to encourage people to get outside and have fun and get active  
  The idea is that people will get back in shape and the world around them will be more fun  
  My goal is to make healthy living fun  

- [x] Training is easy and rewarding 
  With your personal trainer to develop your skills in a safe and healthy environment  


- [x] Training programs for individuals and groups 
  In addition to regular sessions and competitions  
  All forms of exercise are equally important to your health  
  If you exercise for long enough, it will become an intrinsic part of your life  
  It is important that you take the time to find the right physical activities for you  

- [x] You can do more than you thought, no matter how busy your life may seem  
&lt;/code&gt;&lt;/pre&gt;
    &lt;/noscript&gt;
&lt;/div&gt;</content><category term="Fitness"></category><category term="yoga"></category><category term="calisthenics"></category></entry><entry><title>Intro</title><link href="http://127.0.0.1:8000/My%20USP.html" rel="alternate"></link><published>2019-11-06T00:00:00+01:00</published><updated>2019-11-06T00:00:00+01:00</updated><author><name>streetyogi</name></author><id>tag:127.0.0.1,2019-11-06:/My USP.html</id><summary type="html">&lt;p&gt;Never forget your USPs, everyone has something to contribute&lt;/p&gt;</summary><content type="html">&lt;p&gt;As entrepreneur I develop workout concepts for the health-conscious:
* Short but periodic sequences for sedentary work, supervised and rewarded
* Yoga, body weight exercises, calisthenics, gymnastics (street workout). High- and parallel bars in parks, resistance bands, gymnastic rings, suspension trainers and climbing rope for progressive training in nature for individuals or small groups 
* Videos to enable self-reliant exercising for long term success&lt;/p&gt;</content><category term="Fitness"></category><category term="entrepreneur"></category><category term="calisthenics"></category></entry><entry><title>Ziele setzen</title><link href="http://127.0.0.1:8000/Eine%20Vision%20ist%20von%20N%C3%B6ten.html" rel="alternate"></link><published>2017-05-29T19:51:12+02:00</published><updated>2017-05-29T19:51:12+02:00</updated><author><name>streetyogi</name></author><id>tag:127.0.0.1,2017-05-29:/Eine Vision ist von Nöten.html</id><summary type="html">&lt;p&gt;Setz dir kleine Ziele und nimm dir ein paar Minuten Zeit am Tag&lt;/p&gt;</summary><content type="html">&lt;p&gt;Viele sportlich interessierte Menschen wissen entweder nicht wie sie sich Ziele setzten sollen oder es ist ihnen schlicht egal.&lt;br /&gt;
Ziele sind jedoch eine integrale Komponente eines effektiven Programmes, lenken sie dich doch in einem strukturiertem Trainingsplan. Nat&amp;uuml;rlich kannst du auch ohne gesetzter Ziele stetig voranschreiten. Setzt du dir jedoch qualitativ hochwertige Ziele, wird deine Leistung in die H&amp;ouml;he schie&amp;szlig;en.&lt;/p&gt;
&lt;blockquote class="alignment"&gt;&lt;p&gt;Ziele werden allgemein als "Das Ende in dessen Richtung die M&amp;uuml;he gelenkt wird" bezeichnet&lt;/p&gt;&lt;/blockquote&gt;
&lt;p&gt;Bei k&amp;ouml;rperlichen &amp;Uuml;bungen handelt es sich um konkrete Leistungen die man in Zahlen messen kann. Hier sind die greifbaren&amp;nbsp;Ziele einer meiner Teilnehmerinnen:&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Einen freien Handstand f&amp;uuml;r 10 Sekunden halten k&amp;ouml;nnen.&lt;/li&gt;
&lt;li&gt;Einen Barrensitz f&amp;uuml;r 5 Sekunden halten k&amp;ouml;nnen.&lt;/li&gt;
&lt;li&gt;1 Minute lang frei am Reck h&amp;auml;ngen k&amp;ouml;nnen.&lt;/li&gt;
&lt;li&gt;10 Wiederholungen beim Rudern an den Ringen zu schaffen.&lt;/li&gt;
&lt;li&gt;5 korrekte Klimmz&amp;uuml;ge ausf&amp;uuml;hren zu k&amp;ouml;nnen.&lt;/li&gt;
&lt;li&gt;10 Liegest&amp;uuml;tze zu schaffen.&lt;/li&gt;
&lt;li&gt;5 Barrenst&amp;uuml;tze zu bew&amp;auml;ltigen.&lt;/li&gt;
&lt;li&gt;5 einbeinige Kniebeugen zu schaffen.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;Weitere konkrete Ziele k&amp;ouml;nnten z.B. sein:&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;400 Meter in 60 Sekunden zu laufen.&lt;/li&gt;
&lt;li&gt;K&amp;ouml;rperfettanteil auf 15% zu reduzieren&lt;/li&gt;
&lt;li&gt;5 kg an Muskelmasse zuzulegen.&lt;/li&gt;
&lt;li&gt;5 kg an Fettmasse abzunehmen&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;Wenn sich Anf&amp;auml;nger zum ersten mal ein Ziel setzen, haben diese oft ein geringes Ausma&amp;szlig; an Qualit&amp;auml;t. Diese sind schlecht definiert und nicht in Zahlen ausgedr&amp;uuml;ckt auf die hingearbeitet werden kann. Einige Beispiele schwammig formulierter Ziele w&amp;auml;ren z.B.:&lt;/p&gt;
&lt;ol&gt;
&lt;li&gt;Sich bei Barrenst&amp;uuml;tzen zu verbessern.&lt;/li&gt;
&lt;li&gt;Beim Laufen nicht ausser Puste zu geraten.&lt;/li&gt;
&lt;li&gt;Gewicht zu verlieren.&lt;/li&gt;
&lt;li&gt;Muskeln aufzubauen.&lt;/li&gt;
&lt;li&gt;K&amp;ouml;rperlich eine gute Verfassung zu erreichen.&lt;/li&gt;
&lt;/ol&gt;
&lt;p&gt;Ein &amp;Uuml;bungsprogramm hat konkrete Ziele als Basis. Wenn du dir als Ziel gesetzt hast 10 Barrenst&amp;uuml;tze zu schaffen ist es logisch die Kapazit&amp;auml;t f&amp;uuml;r einen Barrenst&amp;uuml;tz aufzubauen, dann f&amp;uuml;r zwei, drei, und so weiter bis du dein Ziel erreicht hast.&lt;/p&gt;
&lt;p&gt;Ein anderer Weg um zu verstehen wie man sich konkrete Ziele setzt ist das SMART-Model:&lt;/p&gt;
&lt;ul&gt;
&lt;li&gt;&lt;strong&gt;S&lt;/strong&gt;pezifisch&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;M&lt;/strong&gt;essbar&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;A&lt;/strong&gt;ktion&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;R&lt;/strong&gt;ealistisch&lt;/li&gt;
&lt;li&gt;&lt;strong&gt;T&lt;/strong&gt;empo&lt;/li&gt;
&lt;/ul&gt;
&lt;p&gt;Du m&amp;ouml;chtest sicherstellen das deine Ziele ihren Zweck erf&amp;uuml;llen. Nehmen Wir Adam und Monika als Beispiel: Adam m&amp;ouml;chte "st&amp;auml;rker werden", hat sich aber als Ziel gesetzt 150 Liegest&amp;uuml;tze in Folge zu schaffen. Dies hat wenig Substanz da 150 Liegest&amp;uuml;tze in Folge eine effektive &amp;Uuml;bung f&amp;uuml;r deine Ausdauer, nicht jedoch f&amp;uuml;r deine Kraft sind. In einem anderen Beispiel m&amp;ouml;chte Monika "hervorragende Handst&amp;auml;nde" vorzeigen, ein Ziel, 30 Klimmz&amp;uuml;ge zu schaffen, wird sie jedoch nicht n&amp;auml;her an diese F&amp;auml;higkeit bringen.&lt;/p&gt;
&lt;p&gt;Jetzt komme ich ins Spiel. Um sicher zu stellen das deine SMART-Ziele ihren Zweck erf&amp;uuml;llen, zerlege ich deine gew&amp;uuml;nschte F&amp;auml;higkeit in einzelne unterscheidbare Komponenten. Kehren wir als Beispiel zu Adam zur&amp;uuml;ck,&amp;nbsp;dem ich empfehlen w&amp;uuml;rde&amp;nbsp;extreme Krafttechniken aus der Gymnastik wie z.B. &amp;nbsp;die St&amp;uuml;tzwaage, oder Kniebeugen mit seinem zweifachen K&amp;ouml;rpergewicht auf seinem R&amp;uuml;cken, als Ziel zu verfolgen. Monikas Verlangen nach einem gro&amp;szlig;artigen Handstand w&amp;uuml;rde ich in zwei SMART-Ziele zerlegen, erstens, einen Handstand f&amp;uuml;r 20 Sekunden gegen die Wand zu halten, und zweitens einen freien Handstand f&amp;uuml;r 5 Sekunden zu halten.&lt;/p&gt;
&lt;p&gt;Ein Widerspruch ist das viele Athleten glauben ihre Leistung durch K&amp;ouml;rpergewichts&amp;uuml;bungen niedriger Intensit&amp;auml;t &amp;nbsp;verbessern k&amp;ouml;nnen. Adams urspr&amp;uuml;ngliches Ziel durch 150 Liegest&amp;uuml;tze in Folge "st&amp;auml;rker zu werden" bedeutet nicht das er stark wird,&amp;nbsp;sondern das er eine gute Ausdauer bei der Aus&amp;uuml;bung von Liegest&amp;uuml;tzen erreicht.&lt;/p&gt;
&lt;blockquote&gt;&lt;p&gt;Zum Kraftaufbau durch das eigene K&amp;ouml;rpergewicht bedarf es eines gewissen Ma&amp;szlig;es an Kreativit&amp;auml;t und man sollte seinen Horizont erweitern. Wenn du es ernst meinst deine Ausdauer zu verbessern, ist es viel einfacher wenn du bereits stark und kr&amp;auml;ftig bist&lt;/p&gt;&lt;/blockquote&gt;
&lt;p&gt;Ein Mangel an k&amp;ouml;rperlicher Kraft wird dich immer in anderen Bereichen einschr&amp;auml;nken, sei es bei der richtigen Ausf&amp;uuml;hrung der &amp;Uuml;bungen, der Ausdauer, &amp;nbsp;der gew&amp;uuml;nschten F&amp;auml;higkeit, beim Gleichgewicht, bei deiner aktiven und passiven Flexibilit&amp;auml;t, deiner Beweglichkeit und Koordination. K&amp;ouml;rperliche Kraft um in diesen Bereichen zu gl&amp;auml;nzen&amp;nbsp;wird vorausgesetzt, Defizite in diesen Dom&amp;auml;nen schr&amp;auml;nken deine Kraft jedoch meistens nicht ein, dies solltest du bei der Auswahl deiner Ziele beachten.&lt;/p&gt;
&lt;p&gt;Zum Abschluss m&amp;ouml;chte ich noch etwas &amp;uuml;ber unrealistische Ziele schreiben. Es ist einfach zu sagen das du einen Klimmzug schaffen willst, genug &amp;Uuml;bung vorausgesetzt, is dies relativ einfach zu erreichen. Andere setzen sich als Ziel 10 Liegest&amp;uuml;tze in der St&amp;uuml;tzwaage zu schaffen. Da es sich um eine schwierige Bewegung im fortgeschrittenen Kraftsegment handelt, ist es unrealistisch, 10 Wiederholungen von diesen zu schaffen, vergleichbar w&amp;auml;ren 10 Wiederholungen mit 250 kg beim Bankdr&amp;uuml;cken, genauso unrealistisch f&amp;uuml;r die meisten.&lt;/p&gt;
&lt;p&gt;Um Profizienz&amp;nbsp;in F&amp;auml;higkeiten zu erlangen, die den Fortgeschrittenen oder der Elite vorbehalten sind, bedarf es jahrelanger &amp;Uuml;bung. Das soll dich jetzt nicht entmutigen sondern dich dazu anspornen, vern&amp;uuml;nftige Ziele zu setzen die du auch erreichen kannst.&lt;/p&gt;
&lt;blockquote&gt;&lt;p&gt;Ziele zu erreichen ist ein gro&amp;szlig;artiges Gef&amp;uuml;hl das dir genug Dynamik geben wird um dir neue Ziele zu setzten&lt;/p&gt;&lt;/blockquote&gt;
&lt;p&gt;Wenn du deine Ziele nie erreichst dann wirst du schnell Ausreden finden die dich von deinem Trainingsplan abbringen.&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;
&lt;p&gt;&amp;nbsp;&lt;/p&gt;</content><category term="Fitness"></category><category term="entrepreneur"></category><category term="calisthenics"></category></entry><entry><title>Dekonstruktion Einarmiger Handstand</title><link href="http://127.0.0.1:8000/Oben%20ist%20Unten.html" rel="alternate"></link><published>2015-12-20T22:18:02+01:00</published><updated>2015-12-20T22:18:02+01:00</updated><author><name>streetyogi</name></author><id>tag:127.0.0.1,2015-12-20:/Oben ist Unten.html</id><summary type="html">&lt;p&gt;So nah drann, 8 Finger :)&lt;/p&gt;</summary><content type="html">&lt;p&gt;Bevor ich mein eigenes Tutorial poste, hier schon mal eine Interessante und ausführliche Beschreibung für alle&lt;br&gt;
die den einarmigen Handstand lernen wollen und den notwendigen Willen dazu aufbringen, in englischer Sprache.  &lt;/p&gt;
&lt;p&gt;&lt;img alt="Einarmiger Handstand" src="http://127.0.0.1:8000/images/OAHS-v02.jpg"&gt;&lt;/p&gt;
&lt;p&gt;Awesome guest post on one-armed handstands from Ryan Hurst of @gmbfit. If you want to do impressive stuff, &lt;br&gt;
this is definitely inspiring!&lt;/p&gt;
&lt;p&gt;Quelle: &lt;em&gt;&lt;a href="http://chrissalvato.com/2013/07/case-study-achieving-the-one-arm-handstand-hold/"&gt;Deconstructing the One Arm Handstand - Chris Salvato&lt;/a&gt;&lt;/em&gt;&lt;/p&gt;
&lt;p style="text-align: left;"&gt;</content><category term="Fitness"></category><category term="handstand"></category></entry><entry><title>Sport Journal</title><link href="http://127.0.0.1:8000/Liste%20an%20%C3%9Cbungen%20und%20Equipment.html" rel="alternate"></link><published>2013-03-10T00:00:00+01:00</published><updated>2013-03-10T00:00:00+01:00</updated><author><name>streetyogi</name></author><id>tag:127.0.0.1,2013-03-10:/Liste an Übungen und Equipment.html</id><summary type="html">&lt;p&gt;Gesammelt, praktiziert, vergessen, wiederbelebt&lt;/p&gt;</summary><content type="html">&lt;ul&gt;
&lt;li&gt;Flexibility (Yoga, Stretching) &lt;/li&gt;
&lt;li&gt;Core (Hanging Situps) &lt;/li&gt;
&lt;li&gt;Acrobatics &lt;/li&gt;
&lt;li&gt;Parcour &lt;/li&gt;
&lt;li&gt;dance &lt;/li&gt;
&lt;li&gt;Bodyweight (Barstarzz) &lt;/li&gt;
&lt;li&gt;Jiu Jitsu &lt;/li&gt;
&lt;li&gt;Thaybox &lt;/li&gt;
&lt;li&gt;Studium &lt;/li&gt;
&lt;li&gt;Paralletesübungen lt. American-Gymnast/Dr. Sommer &lt;/li&gt;
&lt;li&gt;Krähe seitlich &lt;/li&gt;
&lt;li&gt;Frontlever am Türreck lt. Dr. Sommer &lt;/li&gt;
&lt;li&gt;Handstand an der Wand, Push ups auf Knöchel &lt;/li&gt;
&lt;li&gt;Gewicht auf 1 Hand &lt;/li&gt;
&lt;li&gt;kleine Schritte weg von der Wand bis reverse Planche, push ups &lt;/li&gt;
&lt;li&gt;Kopfstand an der Wand, Füße Waagrecht, Kopf durchdrücken &lt;/li&gt;
&lt;li&gt;Brücke auf Erhöhung in den Handstand &lt;/li&gt;
&lt;li&gt;Dehnmaschine gerade, seitlich &lt;/li&gt;
&lt;li&gt;Handtuch schultern dehnen (drehen, hinter Rücken hand oben, eine unten)&lt;/li&gt;
&lt;li&gt;Liegestütz, Füße an der Wand, Sessel, TRX &lt;/li&gt;
&lt;li&gt;Swissball: Situps, Rücken dehnen nach hinten, seitlich &lt;/li&gt;
&lt;li&gt;Iron Cross zwischen 2 Stühlen oder Ringe, hängend (gravity boots) mit Gewichtern &lt;a href="http://www.t-nation.com/free_online_article/sports_body_training_performance/the_iron_cross_for_bodybuilders"&gt;Dr. Sommer&lt;/a&gt;&lt;/li&gt;
&lt;li&gt;Skorpion &lt;/li&gt;
&lt;li&gt;Trainingsband, Rotatormanschetten und hinter Rücken &lt;/li&gt;
&lt;li&gt;Rolle nach hinten in handstand/kopfstand/hollow back &lt;/li&gt;
&lt;li&gt;Inventar: &lt;/li&gt;
&lt;li&gt;Nackenschlaufe &lt;/li&gt;
&lt;li&gt;Gravity boots &lt;/li&gt;
&lt;li&gt;Trainingsband &lt;/li&gt;
&lt;li&gt;Ringe &lt;/li&gt;
&lt;li&gt;Sprossenwand &lt;/li&gt;
&lt;li&gt;Saltogürtel/Turnweste &lt;/li&gt;
&lt;li&gt;Fractional plates&lt;/li&gt;
&lt;/ul&gt;</content><category term="Fitness"></category><category term="gymnastics"></category><category term="calisthenics"></category></entry></feed>